
#38
import math
#a=3
#b=4
#c=math.sqrt(a**2+b**2)
#print(c)

#68
#a=int(input("введите первое число: "))
#a1=int(input("введите второе число: "))
#a2=int(input("введите третье число: "))
#a3=int(input("введите четвертое число: "))
#a4=int(input("введите пятое число: "))
#c=(a+a1+a2+a3+a4)//5
#if c%2==0:
#    print(c,"является четным")
#if c%2!=0:
#    print(c,"является нечетным")

#8
#x=int(input())
#y=math.sqrt(x**5-x**4+abs(x**3))

##76
a=int(input("введите первое число: "))
a1=int(input("введите второе число: "))
a2=int(input("введите третье число: "))
a3=int(input("введите четвертое число: "))
while a/2 :
    print("первое число кратное 2")
elif a1/2:
    print("второе число кратное 2")
elif a2/2:
    print("третье число кратное 2")
elif a3/2:
    print("четвертое число кратное 2")
