import random
import time

letter={1: "1 Красное", 2:"2 Черное", 3:"3 Красное", 4:"4 Черное", 5:"5 Красное",
6:"6 Черное", 7:"7 Красное",8:"8 Черное", 9:"9 Красное", 10:"10 Черное",
11:"11 Красное",12:"12 Черное", 13:"13 Красное", 14:"14 Черное", 15:"15 Красное",
16:"16 Черное",17:"17 Красное", 18:"18 Черное", 19:"19 Красное", 20:"20 Черное",
21: "Зеленое",22:"1", 23:"3", 24:"4", 25:"5", 26:"6", 27:"7", 28:"8", 29:"9", 30:"10",
31:"11",32:"12", 33:"13", 34:"14", 35:"15", 36:"16", 37:"17", 38:"18", 39:"19", 40:"20",
41:"0",42:"Красное", 43:"Черное", 44:"Красное", 45:"Черное", 46:"Красное",
47:"Черное", 48:"Красное", 49:"Черное", 50:"Красное", 51:"Черное",
52:"Красное", 53:"Черное", 54:"Красное", 55:"Черное", 56: "Красное",
57:"Черное", 58:"Красное", 59:"Черное", 60:"Красное", 61:"Черное", 62:"Зеленое"}

t= letter [random.randrange (1,22)]
d= letter [random.randrange (22,43)]
e= letter [random.randrange (43,63)]

d= input("На что ставим, Цвет или Число? ")
if d == "Цвет":
    f= input("На что ставим Красное, Черное или Зеленое ")
else:
    print("нет")

print("Барабан крутиться")
time.sleep (3.025)

if d == "Цвет":
    if f == "Красное":
        if f == d:
            print("Выиграл")
        else:
            print("Проиграл")

if d == "Цвет":
    if f == "Черное":
        if f == t:
            print("Выиграл")
        else:
            print("Проиграл")    

if d == "Цвет":
    if f == "Зеленое":
        if f == e:
            print("Выиграл")
        else:
            print("Проиграл")
